# -*- coding: UTF-8 -*-
import json
# from showTable import App
import sys
# from PyQt5.QtWidgets import QMainWindow, QApplication

reload(sys)
sys.setdefaultencoding('utf8')
# app = QApplication(sys.argv)
# jsondate = 'key{"pid":1361,"CPU":"0.1%","内存占用率":"1.91%","GPU":"1.1%","硬盘占用率":"1%","网络":"0.1","I/O":"1"}key{"pid":1362,"CPU":"0.2%","内存占用率":"1.92%","GPU":"1.2%","硬盘占用率":"2%","网络":"0.1","I/O":"1"}key{"pid":1363,"CPU":"0.3%","内存占用率":"1.93%","GPU":"1.3%","硬盘占用率":"3%","网络":"0.1","I/O":"1"}key{"pid":1364,"CPU":"0.4%","内存占用率":"1.94%","GPU":"1.4%","硬盘占用率":"4%","网络":"0.1","I/O":"1"}key{"pid":1365,"CPU":"0.5%","内存占用率":"1.95%","GPU":"1.5%","硬盘占用率":"5%","网络":"0.1","I/O":"1"}key{"pid":1366,"CPU":"0.6%","内存占用率":"1.96%","GPU":"1.6%","硬盘占用率":"6%","网络":"0.1","I/O":"1"}key{"pid":1367,"CPU":"0.7%","内存占用率":"1.97%","GPU":"1.7%","硬盘占用率":"7%","网络":"0.1","I/O":"1"}key{"pid":1368,"CPU":"0.8%","内存占用率":"1.98%","GPU":"1.8%","硬盘占用率":"8%","网络":"0.1","I/O":"1"}key{"pid":1369,"CPU":"0.9%","内存占用率":"1.99%","GPU":"1.9%","硬盘占用率":"9%","网络":"0.1","I/O":"1"}key{"pid":13610,"CPU":"1.0%","内存占用率":"2.0%","GPU":"2.0%","硬盘占用率":"10%","网络":"0.1","I/O":"1"}'
# dataTodict(jsondate)
# ex = App(11,8,jsondate)
# sys.exit(app.exec_())  

# 
def dataTodict(data):
    list1=[]
    strlist = data.split("key")
    for i in range(1,len(strlist)):
        print(strlist[i])
        print(type(strlist[i]))
        user_dict = json.loads(strlist[i])
        list1.append(user_dict)
    print(type(list1[1]))    
    return list1

if __name__ == '__main__':
    jsondate = 'key{"pid":1361,"CPU":"0.1%","内存占用率":"1.91%","GPU":"1.1%","硬盘占用率":"1%","网络":"0.1","I/O":"1"}key{"pid":1362,"CPU":"0.2%","内存占用率":"1.92%","GPU":"1.2%","硬盘占用率":"2%","网络":"0.1","I/O":"1"}key{"pid":1363,"CPU":"0.3%","内存占用率":"1.93%","GPU":"1.3%","硬盘占用率":"3%","网络":"0.1","I/O":"1"}key{"pid":1364,"CPU":"0.4%","内存占用率":"1.94%","GPU":"1.4%","硬盘占用率":"4%","网络":"0.1","I/O":"1"}key{"pid":1365,"CPU":"0.5%","内存占用率":"1.95%","GPU":"1.5%","硬盘占用率":"5%","网络":"0.1","I/O":"1"}key{"pid":1366,"CPU":"0.6%","内存占用率":"1.96%","GPU":"1.6%","硬盘占用率":"6%","网络":"0.1","I/O":"1"}key{"pid":1367,"CPU":"0.7%","内存占用率":"1.97%","GPU":"1.7%","硬盘占用率":"7%","网络":"0.1","I/O":"1"}key{"pid":1368,"CPU":"0.8%","内存占用率":"1.98%","GPU":"1.8%","硬盘占用率":"8%","网络":"0.1","I/O":"1"}key{"pid":1369,"CPU":"0.9%","内存占用率":"1.99%","GPU":"1.9%","硬盘占用率":"9%","网络":"0.1","I/O":"1"}key{"pid":13610,"CPU":"1.0%","内存占用率":"2.0%","GPU":"2.0%","硬盘占用率":"10%","网络":"0.1","I/O":"1"}'
    list2 = dataTodict(jsondate)
    print(list2)